<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Bitcoin Helposti Selitettynä</title>

    <!-- Bootstrap -->
    <!-- Latest compiled and minified CSS -->
    <link rel="stylesheet" href="http://maxcdn.bootstrapcdn.com/bootstrap/3.2.0/css/bootstrap.min.css">
    <link href="http://netdna.bootstrapcdn.com/font-awesome/3.2.0/css/font-awesome.min.css" rel="stylesheet">


    <!-- Custom styles for this template -->
    <link href="jumbotron-narrow.css" rel="stylesheet">

    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
      <script src="https://oss.maxcdn.com/html5shiv/3.7.2/html5shiv.min.js"></script>
      <script src="https://oss.maxcdn.com/respond/1.4.2/respond.min.js"></script>
    <![endif]-->
  </head>
  <body>
  <div class="container">
    <div class="header">
        <ul class="nav nav-pills pull-right">
          <li><a href="#miksi_bitcoin">Bitcoin Helposti</a></li>
          <li><a href="eurosta-eroaminen.html">Eurosta Eroaminen</a></li>
          <li><a href="http://btc-suomi.org/">Keskustelu</a></li>
        </ul>
        <h3 class="text-muted">EroaEurosta.fi</h3>
      </div>

      <div class="row marketing">
        <div class="col-lg-12">

          <h1>
    <span class="s1">Bitcoin Helposti Selitettyn&auml;</span></h1>
<p class="lead">Jos viel&auml;kin mietit, mik&auml; ihmeen Bitcoin, t&auml;m&auml; teksti on sinulle.&nbsp;</p>

<p><img class="img-responsive" src="omena.jpeg"/><br/></p>

<p><span class="s1">On hieno p&auml;iv&auml; ja min&auml; istun kanssasi puistonpenkill&auml;.</span></p>
<p class="p1"><span class="s1">Minulla on yksi omena, jonka ojennan sinulle.</span></p>
<p class="p1"><span class="s1">Nyt sinulla on omena ja minulla ei ole.</span></p>
<p class="p1"><span class="s1">Yksinkertaista, eik&ouml; vain?</span></p>
<p class="p1"><strong><span class="s1">Katsotaampa tarkemmin, mit&auml; juuri &auml;sken tapahtui:</span></strong></p>
<p class="p1"><span class="s1">Omenani siirtyi fyysisesti sinulle. Sin&auml; tied&auml;t, ett&auml; n&auml;in tapahtui, koska olimme molemmat puiston penkill&auml; ja annoin sinulle konkreettisesti omenan.</span></p>
<p class="p1"><span class="s1">Emme tarvinneet t&auml;h&auml;n siirtoon <em>kolmannen osapuolen apua</em>. Selvisimme ilman Heikki Salon todistamista (joka tunnettu asianajaja).&nbsp;</span></p>
<p class="p1"><span class="s1">Nyt omena on sinun! En voi antaa sinulle enemp&auml;&auml; omenoita, koska minulla ei ole yht&auml;&auml;n j&auml;ljell&auml;. Enk&auml; kontrolloi antamaani omenaa en&auml;&auml;, se on sinun. Luovutin omenan omistusoikeuden sinulle, nyt sin&auml; kontrolloit sit&auml;. Voit tehd&auml; omenalle t&auml;sm&auml;lleen mit&auml; haluat, voit antaa sen kaverillesi, joka voi taas antaa omenan eteenp&auml;in h&auml;nen kaverilleen jne..</span></p>
<p class="p1"><span class="s1">Tapahtunutta kutsutaan henkil&ouml;kohtaiseksi vaihtokaupaksi. Mielest&auml;ni on t&auml;ysin sama annanko sinulle banaanin, omenan, kirjan tai <em>5 euron setelin</em>&hellip;.</span></p>
<p class="p1"><span class="s1">Nyt menen asioiden edelle.</span></p>
<h3>
    <span class="s1">Takaisin omenoiden pariin!</span></h3>

    <p><img class="img-responsive" src="omena_pikseli.jpeg"/><br/></p>

<p><span class="s1"><span style="font-size: 12px;">T&auml;ll&auml; kertaa minulla on yksi <em>digitaalinen</em> omena. T&auml;ss&auml; saat <em>digitaalisen</em> omenani.</span></span></p>
<p class="p1"><span class="s1">Ahaa! Nyt vaihtokauppa menee mielenkiintoiseksi.</span></p>
<p class="p1"><span class="s1">Mist&auml; tied&auml;t, ett&auml; <em>juuri se </em>antamani digitaalinen omena on nyt vain ja ainuastaan sinun hallussa? Mietipp&auml; t&auml;t&auml; hetki.</span></p>
<p class="p1"><span class="s1">Tilanne on nyt paljon monimutkaisempi eik&ouml; vain? Mist&auml; tied&auml;t, ett&auml; en l&auml;hett&auml;nyt omenaa ensin s&auml;hk&ouml;postin liitetiedostona Heikki Salolle tai kaverilleni Penalle?&nbsp;</span></p>
<p class="p1"><span class="s1">Ehk&auml; satuin ottamaan muutaman kopion digitaalisesta omenastani l&auml;pp&auml;rille. Ehk&auml; jaoin sen Piratebayssa ja miljoonat ihmiset latasivat sen itselleen.</span></p>
<p class="p1"><span class="s1">Kuten huomaat, digitaalinen vaihtokauppa on hieman ongelmallisempi. Digitaalisen omenan l&auml;hett&auml;minen ei vastaa fyysisen omenan antamista.</span></p>
<p class="p1"><span class="s1">Muutama &nbsp;fiksu n&ouml;rtti on pystynyt nime&auml;m&auml;&auml;n t&auml;m&auml;n ongelman: sit&auml; kutsutaan <strong>&lsquo;double-spending&rsquo; -ongelmaksi</strong>  &mdash;  (kaksinkertaisen k&auml;yt&ouml;n ongelma). &Auml;l&auml; huoli, sinun tarvitsee vain tiet&auml;&auml;, ett&auml; kyseinen ongelma on h&auml;mment&auml;nyt n&auml;it&auml; n&ouml;rttej&auml; jo jonkin aikaa l&ouml;yt&auml;m&auml;tt&auml; siihen ratkaisua.</span></p>
<p class="p1"><span class="s1">Kunnes&hellip;</span></p>
<p class="p1"><span class="s1">Mutta yritet&auml;&auml;np&auml; yhdess&auml; mietti&auml; siihen ratkaisua.</span></p>
<h3>
    <span class="s1">Tilikirja </span></h3>

    <p><img class="img-responsive" src="tilikirja.jpg"/><br/></p>

<p><span class="s1">Ehk&auml; n&auml;it&auml; digitaalisia omenia t&auml;ytyy seurata <strong>kirjanpidolla</strong>. Tilikirja sis&auml;lt&auml;&auml; kaikki transaktiot (transaktio = yksitt&auml;inen liiketapahtuma = siirto) ja t&auml;t&auml; kokonaisuutta kutsutaan kirjanpidoksi.&nbsp;</span></p>
<p class="p1"><span class="s1">Kun t&auml;m&auml; tilikirja tai kirjanpito on digitaalinen, sen t&auml;ytyy py&ouml;ri&auml; omassa maailmassaan ja se kirjanpito tarvitsee jonkun p&auml;ivyst&auml;m&auml;&auml;n, sek&auml; yll&auml;pit&auml;m&auml;&auml;n sit&auml;.</span></p>
<p class="p1"><span class="s1">Esimerkiksi. World of Warcraft. <em>Blizzard</em>, tiimi, joka loi kyseisen online-pelin, pit&auml;&auml; hallussaan &rdquo;digitaalista kirjanpitoa kaikista harvinaisista esineist&auml;, joita heid&auml;n peliss&auml;&auml;n on. mahtavaa -L&ouml;ysimme ratkaisun!</span></p>
<h3>
    <span class="s1">Ongelmat</span></h3>
<p class="p1">T&auml;ss&auml; on kuitenkin muutamia ongelmia:</p>
<p class="p1"><span class="s1">Mit&auml; jos Blizzardin ty&ouml;ntekij&auml; tekee n&auml;it&auml; esineit&auml; lis&auml;&auml;? H&auml;n voisi koska vain lis&auml;t&auml; digitaalisia omenoita h&auml;nen saldoihinsa!</span></p>
<p class="p1"><span class="s1">Se ei ole t&auml;ysin sama asia, kuin meid&auml;n vaihtokauppa puiston penkill&auml;. Silloin olimme vain kahdestaan. Blizzardin kautta k&auml;yty vaihtokauppa on kuin repisimme Heikki Salon oikeussalista puiston penkille v&auml;litt&auml;m&auml;&auml;n kaikkia meid&auml;n vaihtokauppoja (transaktioita). Kuinka voisin antaa digitaaliset omenani sinulle, niin kuin normaaliin tapaan?</span></p>
<blockquote>
    <p class="p1"><span class="s1">Onko mit&auml;&auml;n tapaa j&auml;ljitell&auml; puistonpenkin tapahtumaa, meid&auml;n v&auml;list&auml; vaihtokauppaa (transaktiota) digitaalisesti? Vaikuttaa aika vaikealta&hellip;</span></p>
</blockquote>
<p class="p2">&nbsp;</p>
<h3>
    <span class="s1">Ratkaisu</span></h3>
    <p><img class="img-responsive" src="verkko.gif"/><br/></p>
<p class="p2">(kuva)</p>
<p class="p1"><span class="s1">Mit&auml; jos annamme t&auml;m&auml;n kyseisen tilikirjan <strong>kaikille</strong>? Blizzardin tietokoneiden sijasta, tilikirja el&auml;&auml; kaikkien halukkaiden tietokoneilla. Alusta alkaen kaikki digitaalisten omenien vaihtokaupat (transaktiot) tallentuvat t&auml;h&auml;n.&nbsp;</span></p>
<p class="p1"><span class="s1">Sit&auml; ei voi huijata! Min&auml; en voi l&auml;hett&auml;&auml; sinull&auml; yht&auml;&auml;n digitaalista omenaa, joita minulla ei ole. Silloin tilikirja ei <em>synkronoituisi</em> muiden hallussapit&auml;mien tilikirjojen kanssa. Se olisi vaikea j&auml;rjestelm&auml; p&auml;ihitt&auml;&auml;, erityisesti, jos t&auml;m&auml; j&auml;rjestelm&auml; kasvaisi todell&auml; isoksi.</span></p>
<p class="p1"><span class="s1">Lis&auml;ksi tilikirja ei ole yhden ihmisen kontrolloitavissa. T&auml;ten tied&auml;n, ettei kukaan pysty luomaan itselleen lis&auml;&auml; digitaalisia omenoita. T&auml;m&auml;n j&auml;rjestelm&auml;n s&auml;&auml;nn&ouml;t m&auml;&auml;riteltiin <em>heti alussa j&auml;rjestelm&auml;n luonnin yhteydess&auml;</em>. Ja koodij&auml;rjestelm&auml; ja s&auml;&auml;nn&ouml;t ovat avointa l&auml;hdekoodia &mdash; tied&auml;th&auml;n, niin kuin k&auml;ytt&ouml;j&auml;rjestelm&auml;, jota &auml;itisi Android &auml;lypuhelin k&auml;ytt&auml;&auml;. Tai v&auml;h&auml;n niin kuin Wikipedia. Se on fiksujen ihmisten yll&auml;pidett&auml;v&auml;n&auml;, turvattavana, kehitett&auml;v&auml;n&auml; ja tarkistettavana.</span></p>
<p class="p1"><span class="s1">Voit osallistua t&auml;h&auml;n verkostoon, voit p&auml;ivitell&auml; tilikirjaa ja t&auml;ten varmistaa sen toimivuutta. Vaivann&auml;&ouml;st&auml; voit saada 25 digitaalista omenaa palkkioksi. Itse asiassa, se on ainut tapa luoda lis&auml;&auml; digitaalisia omenoita t&auml;h&auml;n j&auml;rjestelm&auml;&auml;n.&nbsp;</span></p>
<h3>
    <span class="s1">Min&auml; yksinkertaistin aika lailla</span></h3>
<p class="p1"><span class="s1">&hellip; Mutta selitt&auml;m&auml;ni j&auml;rjestelm&auml; on olemassa. Sit&auml; kutsutaan Bitcoin-protokollaksi. Ja n&auml;m&auml; digitaaliset omenat ovat &rdquo;bitcoineja&rdquo; t&auml;m&auml;n j&auml;rjestelm&auml;n sis&auml;ll&auml;. Nerokasta!</span></p>
<p class="p2"><strong>Mutta mit&auml; avoin tilikirja mahdollistaa?</strong></p>
<p class="p1"><span class="s1">1) Muistatko, ett&auml; se pohjautuu avoimeen l&auml;hdekoodiin? Omenoiden kokonaism&auml;&auml;r&auml; (lopullinen m&auml;&auml;r&auml;) on m&auml;&auml;ritelty avoimeen tilikirjaan sit&auml; luodessa. Min&auml; tied&auml;n t&auml;m&auml;nhetkisen tarkan olemassaolevan m&auml;&auml;r&auml;n. <strong>Tied&auml;n j&auml;rjestelm&auml;ss&auml; olevien omenoiden m&auml;&auml;r&auml;n olevan rajallinen (niukka).</strong></span></p>
<p class="p1"><span class="s1">2) Vaihtokaupan j&auml;lkeen, <strong>tied&auml;n omenoiden todistettavasti siirtyneen minun omistuksesta sinun omistukseen. En kyennyt sanomaan t&auml;t&auml; digitaalisista asioista.</strong> Siirrot varmistetaan ja todennetaan tilikirjasta ja sitten p&auml;ivitet&auml;&auml;n kyseiseen, julkiseen, tilikirjaan.</span></p>
<p class="p1"><span class="s1">Koska tilikirja on julkinen, <strong>en tarvinnut Heikki Saloa (kolmatta osapuolta)</strong> varmistamaan, ett&auml; en huijannut tai luonut ylim&auml;&auml;r&auml;isi&auml; kopioita itselleni tai l&auml;hett&auml;nyt omenoita kahdesta tai kolmesti&hellip;</span></p>
<blockquote>
    <p class="p1"><span class="s1">J&auml;rjestelm&auml;ss&auml; digitaalisten omenoiden vaihtokauppa on kuin fyysisen kiven omistuksen vaihtuminen. Se on yht&auml; p&auml;tev&auml;, kuin n&auml;hdess&auml; fyysisen omenan tippuvan k&auml;dest&auml;ni sinun taskuun. Ja niin kuin puistonpenkill&auml;, t&auml;h&auml;n vaihtokauppaan osallistui vain kaksi ihmist&auml;. Min&auml; ja sin&auml; &mdash; me emme tarvinneet Heikki Saloa varmistamaan ja todistamaan puiston vaihtokauppaa.&nbsp;</span></p>
</blockquote>
<p class="p1"><span class="s1">Toisin sanoen Bitcoin-protokolla&nbsp;<em>k&auml;ytt&auml;ytyy kuin fyysinen esine</em>.</span></p>
<p class="p1"><span class="s1">Tied&auml;tk&ouml; mik&auml; on hienoa? Bitcoin-protokolla on siit&auml; huolimatta digitaalinen. Me voimme diilata 1<em>,000 omenaa</em>, <em>miljoona omenaa</em> tai vaikkapa <em>0.0000001 omenaa</em>. Voin l&auml;hett&auml;&auml; kyseisen m&auml;&auml;r&auml;n vain yhdell&auml; hiiren klikkauksella ja voin ojentaa sen <em>digitaaliseen</em> taskuusi vaikka olisin Nigeriassa ja sin&auml; olisit matkalla New Yorkiin.</span></p>
<p class="p1"><span class="s1">Min&auml; voin jopa tehd&auml; <em>muita digitaalisia siirtoja t&auml;m&auml;n digitaalisen omenan sis&auml;ll&auml;</em>! Kaikki on kuitenkin digitaalista. Ehk&auml; voin lis&auml;t&auml; jotain teksti&auml; siihen &mdash; digitaalisen viestin, tai ehk&auml; voin liitt&auml;&auml; paljon t&auml;rke&auml;mpi&auml; asioita siihen esim: sopimuksen, osakekirjan tai henkil&ouml;kortin..</span></p>
<p class="p1"><span class="s1">T&auml;m&auml;h&auml;n on mahtavaa! Kuinka meid&auml;n tulisi k&auml;sitell&auml; n&auml;it&auml; &rdquo;digitaalisia omenoita&rdquo;? Ne ovat varsin hy&ouml;dyllisi&auml;, eiv&auml;tk&ouml; olekin?</span></p>
<p class="p1"><span class="s1">Monet kinastelevat siit&auml; t&auml;ll&auml;kin hetkell&auml;, on kiivasta keskustelua t&auml;m&auml;n ja tuon taloustieteen koulukunnan, poliitikkojen ja ohjelmoijien v&auml;lill&auml;. &Auml;l&auml; kuitenkaan kuuntele niit&auml; kaikkia. Osa ihmisist&auml; on viisaita, osa harhaanjohtavia. Osa sanoo j&auml;rjestelm&auml;n arvon olevan pilvissa ja osa sanoo sen olevan arvoton. Joku antaa konkreettisen arvon: $1,300 omenalta. Jotkut sanoo sen olevan <em>digitaalista kultaa</em>, jotkut kutsuvat sit&auml; <em>valuutaksi</em>. Muut sanovat niit&auml; vain tulppaaneiksi (<a href="http://fi.wikipedia.org/wiki/Tulppaanimania">Tulppaanimania</a>). Jotkut sanovat sen mullistavan maailmaa, jotkut sanovat sit&auml; vain villitykseksi.</span></p>
<p class="p1"><span class="s1">Minulla on oma mielipide siit&auml;.</span></p>
<p class="p1"><span class="s1">Se tarina j&auml;&auml; kuitenkin toiseen kertaan.&nbsp;</span></p>
<p class="p1"><span class="s1">Nyt kuitenkin tied&auml;t enemm&auml;n Bitcoinista, kuin useimmat.</span></p>
<p class="p1"><em><span class="s1">Kirjoittanut <a href="https://medium.com/@nik5ter/explain-bitcoin-like-im-five-73b4257ac833">Nik Custodo</a>. Vapaasti suomentanut Andre Juselius. Teos on public domainia - sitä saa vapasti muokata ja levittää.</span></em></p>

        </div>
      </div>

      <div class="footer">
        <p>&copy; EroaEurosta.fi</p>
      </div>

    </div> <!-- /container -->


    <!-- jQuery (necessary for Bootstrap's JavaScript plugins) -->
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.1/jquery.min.js"></script>
    <!-- Latest compiled and minified JavaScript -->
    <script src="//maxcdn.bootstrapcdn.com/bootstrap/3.2.0/js/bootstrap.min.js"></script>
  </body>
</html>
